PROC 0 DSN()
CONTROL NOFLUSH NOMSG
IF &DSN EQ &STR() THEN +
  DO
    WRITE Required parameter DSN missing
    EXIT CODE(12)
  END
SET &DSNAME = &DSN
LISTDSI &DSNAME
IF &LASTCC NE 0 THEN +
  DO
    WRITE Dataset &DSNAME not found
    EXIT CODE(8)
  END
WRITE Dataset: &DSNAME
WRITE Volume: &SYSVOLUME
WRITE Unit: &SYSUNIT
WRITE Organization: &SYSDSORG
WRITE Record Format: &SYSRECFM
WRITE Logical Record Length: &SYSLRECL
WRITE Block Size: &SYSBLKSIZE
WRITE Allocation: &SYSALLOC &SYSUNITS
WRITE Used: &SYSUSED &SYSUNITS
EXIT CODE(0)
END